app/controllers/collectors_controller.rb

SELECT  "leaders".* FROM "leaders"  WHERE "leaders"."leader_id" IS NULL LIMIT 1
SELECT  "users".* FROM "users"  WHERE "users"."id" = 1 LIMIT 1
---
  def create
    leader = Leader.find_by(id: params[:leader_id]) #!!!!!!!url does not include leader_id-should come from the form.
    user = User.find_by(id: params[:user_id])