app/controllers/gatherings_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = 1 LIMIT 1
---
  def index
    user = User.find_by(id: params[:user_id])

SELECT  "leaders".* FROM "leaders"  WHERE "leaders"."id" = 1 LIMIT 1
SELECT  "users".* FROM "users"  WHERE "users"."id" = 1 LIMIT 1
SELECT  "gatherings".* FROM "gatherings"  WHERE "gatherings"."leader_id" = 1 AND "gatherings"."user_id" = 1 LIMIT 1
DELETE FROM "gatherings" WHERE "gatherings"."id" = $1  [["id", 19]]
INSERT INTO "gatherings" ("created_at", "leader_handle", "leader_id", "query", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", "2015-02-18 17:08:42.660670"], ["leader_handle", "angelamfield"], ["leader_id", 2], ["query", ""], ["updated_at", "2015-02-18 17:08:42.660670"], ["user_id", 1]]
INSERT INTO "tweets" ("content", "created_at", "gathering_id", "tweet_id", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
UPDATE "gatherings" SET "query" = $1, "updated_at" = $2 WHERE "gatherings"."id" = 25  [["query", "hgjgh hvmjghjk"], ["updated_at", "2015-02-18 17:37:45.227670"]]
UPDATE "leaders" SET "query" = $1, "updated_at" = $2 WHERE "leaders"."id" = 23  [["query", "I"], ["updated_at", "2015-02-18 21:43:28.331991"]]
---
  def create
    leader = Leader.find_by(id: params[:leader_id])
    user = User.find_by(id: params[:user_id])
    gathering = Gathering.find_by(leader_id: leader.id, user_id: user.id)
    gathering.destroy if gathering


    relevant_tweets = TwitterData.basic_search({handle: leader.handle, query: params[:query]}).count
    all_tweets = TwitterData.complete_search({handle: leader.handle}).count
    all_tweets = 0.01 if all_tweets == 0
    ratio = (relevant_tweets.to_f / all_tweets).round(2)

    gathering = Gathering.create(leader_id: leader.id, user_id: user.id, query: params[:query], leader_handle: leader.handle, relevant_tweets: relevant_tweets, all_tweets: all_tweets, ratio: ratio) unless params[:query] == ""

    leader.query = params[:query]
    leader.save