app/controllers/tweets_controller.rb

SELECT "collectors".* FROM "collectors"  WHERE "collectors"."user_id" = $1  [["user_id", 1]]
---
  def all_tweets
    tweets = []
    current_user.collectors.each do |collector|