app/controllers/tweets_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = 1 LIMIT 1
SELECT "gatherings".* FROM "gatherings"  WHERE "gatherings"."user_id" = $1  [["user_id", 1]]
SELECT "tweets".* FROM "tweets"  WHERE "tweets"."gathering_id" = $1  [["gathering_id", 1]]
SELECT "users".* FROM "users"
INSERT INTO "tweets" ("content", "created_at", "gathering_id", "handle", "leader_pic_url", "tweet_creation_time", "tweet_id", "updated_at", "url") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def all_tweets
    user  = User.find_by(id: params[:user_id])

    #populates data_base with all tweets for specific user.
    BackgroundJobsHelper.tweets_for_specific_user(user.id)

    tweets = []
    user.gatherings.each do |gathering|
      tweets << gathering.tweets